; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v1 - type_1 ?v2 - type_3)
 	      (pred_2 ?v3 - object ?v2 - type_3)
	      (pred_1 ?v1 - type_1 ?v8 - type_2)
	      (pred_3 ?v1 - type_1 ?v3 - object ?v8 - type_2))

   (:action op_1
       :parameters  (?v1 - type_1 ?v4 ?v7 - type_3)
       :precondition (and  (pred_4 ?v1 ?v4))
       :effect (and  (pred_4 ?v1 ?v7)
		     (not (pred_4 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_1 ?v5 - object ?v6 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v6) (pred_4 ?v1 ?v6) (pred_1 ?v1 ?v8))
       :effect (and (pred_3 ?v1 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_1 ?v1 ?v8))))

   (:action op_3
       :parameters (?v1 - type_1 ?v5 - object ?v6 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v5 ?v8) (pred_4 ?v1 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_1 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v5 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_10 - type_1
obj_03 obj_01 obj_08 obj_02 - type_2
obj_12 obj_04 obj_09 - type_3
obj_05 obj_07 obj_11 - object)
(:init
(pred_4 obj_06 obj_12)
(pred_1 obj_06 obj_03)
(pred_1 obj_06 obj_01)
(pred_4 obj_10 obj_04)
(pred_1 obj_10 obj_08)
(pred_1 obj_10 obj_02)
(pred_2 obj_05 obj_04)
(pred_2 obj_07 obj_09)
(pred_2 obj_11 obj_09)
)
(:goal
(and
(pred_2 obj_05 obj_09)
(pred_2 obj_07 obj_09)
(pred_2 obj_11 obj_04)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_09)))
)
)

; plan
1. (op_2 obj_10 obj_05 obj_04 obj_02)
   deleted: (pred_2 obj_05 obj_04) (pred_1 obj_10 obj_02)
   added: (pred_3 obj_10 obj_05 obj_02)
   goals met: 1 of 3
2. (op_1 obj_06 obj_12 obj_04)
   deleted: (pred_4 obj_06 obj_12)
   added: (pred_4 obj_06 obj_04)
   goals met: 1 of 3
3. (op_1 obj_10 obj_04 obj_09)
   deleted: (pred_4 obj_10 obj_04)
   added: (pred_4 obj_10 obj_09)
   goals met: 1 of 3
4. (op_3 obj_10 obj_05 obj_09 obj_02)
   deleted: (pred_3 obj_10 obj_05 obj_02)
   added: (pred_2 obj_05 obj_09) (pred_1 obj_10 obj_02)
   goals met: 2 of 3
5. (op_2 obj_10 obj_11 obj_09 obj_08)
   deleted: (pred_2 obj_11 obj_09) (pred_1 obj_10 obj_08)
   added: (pred_3 obj_10 obj_11 obj_08)
   goals met: 2 of 3
6. (op_1 obj_10 obj_09 obj_04)
   deleted: (pred_4 obj_10 obj_09)
   added: (pred_4 obj_10 obj_04)
   goals met: 2 of 3
7. (op_3 obj_10 obj_11 obj_04 obj_08)
   deleted: (pred_3 obj_10 obj_11 obj_08)
   added: (pred_2 obj_11 obj_04) (pred_1 obj_10 obj_08)
   goals met: 3 of 3
